ERP.belugaerp/src/Documents/битДанныеПриборовАСИиУ/битДанныеПриборовАСИиУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битДанныеПриборовАСИиУ</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_ПоказанияПриборовАСИиУ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуточныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиОтправки_ЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаФайлаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.бг_ПриборыАСИиУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/бг_ПриборыАСИиУ/бг_ПриборыАСИиУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_ПриборыАСИиУ</name>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/битДанныеПриборовАСИиУПрисоединенныеФайлы/битДанныеПриборовАСИиУПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битДанныеПриборовАСИиУПрисоединенныеФайлы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.битДанныеПриборовАСИиУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Documents/битДанныеПриборовАСИиУ/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает параметры загрузки данных
//
// Возвращаемое значение:
//    Структура - Параметры загрузки
//
Функция ПараметрыЗагрузкиДанныхАСИиУ() Экспорт
	
	ЭтоРабочаяБаза = бг_ОбщегоНазначенияСервер.ЭтоРабочаяБаза();
	Результат = Новый Структура;
	Результат.Вставить("ФорматФайлов", "xml");
	Результат.Вставить("КаталогФайлов", бг_КонстантыПовтИсп.ЗначениеКонстанты("КаталогФайловДанныхАСИиУ"));
	Результат.Вставить("ЗагружатьПятиминутныеДанные", бг_КонстантыПовтИсп.ЗначениеКонстанты("ЗагружатьПятиминутныеДанныеАСИиУ"));
	УдалениеФайловПослеЗагрузки = бг_КонстантыПовтИсп.ЗначениеКонстанты("УдалятьФайлыДанныхАСИиУПослеЗагрузки");
	Результат.Вставить("УдалятьФайлыПослеЗагрузки", ЭтоРабочаяБаза И УдалениеФайловПослеЗагрузки);
	Результат.Вставить("РазделительДанныеИмяФайла", "_");
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает данные документа связанного с именем файла
// Параметры:
//	ИмяФайла - Строка - Имя файла, например 0_16567_000_20200419_235959_0041_03.xml 
// Возвращаемое значение:
//    Структура - Данные документа, если уже был загружен, содержит
//		* Ссылка - ДокументСсылка.битДанныеПриборовАСИиУ - Ссылка на документ
//      * ХешФайлаДанных - Строка - Хеш файла данных, который был уже загружен
//
Функция ДанныеЗагруженногоДокумента(ИмяФайла) Экспорт
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	битДанныеПриборовАСИиУ.Ссылка КАК Ссылка,
	               |	битДанныеПриборовАСИиУ.ХешСуммаФайлаДанных КАК ХешФайлаДанных
	               |ИЗ
	               |	Документ.битДанныеПриборовАСИиУ КАК битДанныеПриборовАСИиУ
	               |ГДЕ
	               |	битДанныеПриборовАСИиУ.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("Ссылка, ХешФайлаДанных");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Заполняет документ данными файла
// Параметры:
//	Объект - ДокументОбъект.битДанныеПриборовАСИиУ - документ для заполнения
//
Процедура ЗаполнитьДокументПоДаннымФайла(Объект) Экспорт
	ФайлДанных = АктуальныйПрисоединенныйФайлСДанными(Объект.Ссылка);
	Если ФайлДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ФайлДанных);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		
	ТекстФайла = Новый ТекстовыйДокумент;
	Попытка
		ТекстФайла.Прочитать(ИмяВременногоФайла, ЧтениеXML.КодировкаИсточника);
	Исключение
		ТекстФайла.Прочитать(ИмяВременногоФайла);
	КонецПопытки;	
	
	ТекстСУчетомИсправленияВремени = ТекстФайла.ПолучитьТекст();
	ТекстСУчетомИсправленияВремени = СтрЗаменить(ТекстСУчетомИсправленияВремени, "Z</as", "</as");
	ТекстСУчетомИсправленияВремени = СтрЗаменить(ТекстСУчетомИсправленияВремени, "z</as", "</as");
		
	ЧтениеXML.УстановитьСтроку(ТекстСУчетомИсправленияВремени);
	УдалитьФайлы(ИмяВременногоФайла);	
	ПространствоИмен = "http://fsrar.ru/WEGAIS/WB_DOC_SINGLE_01";
	ИмяСвойства = "Documents";
	ТипОбъекта = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).КорневыеСвойства.Получить(ИмяСвойства).Тип;
		
	Попытка
		ОтветXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъекта);
	Исключение
		Возврат;
	КонецПопытки;
		
	Если ОтветXDTO.Document.Asiiu <> Неопределено Тогда
		ДанныеЗагрузки = ОтветXDTO.Document.Asiiu;
		Объект.СуточныеДанные = Истина;
	ИначеЕсли ОтветXDTO.Document.AsiiuTime <> Неопределено Тогда
		ДанныеЗагрузки = ОтветXDTO.Document.AsiiuTime;
		Объект.СуточныеДанные = Ложь;
	КонецЕсли;	
	СтруктураШапкиДокумента = СтруктураШапкиДокументаПоДаннымФайла(ОтветXDTO, ДанныеЗагрузки);
	ЗаполнитьЗначенияСвойств(Объект, СтруктураШапкиДокумента);
	Объект.ДополнительныеСвойства.Вставить("ЗагрузкаИзФайла");
	ДвиженияДокументаИзФайла(Объект, ОтветXDTO, ДанныеЗагрузки);
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ДвиженияДокументаИзФайла(Объект, ОтветXDTO, ДанныеЗагрузки)
	
	ДвиженияДокумента = Объект.Движения;
	ДвиженияДокумента.бг_ПоказанияПриборовАСИиУ.Очистить();
	
	Для каждого ОписаниеПозиции Из ДанныеЗагрузки.Data.Position Цикл
		
		НовоеДвижение = ДвиженияДокумента.бг_ПоказанияПриборовАСИиУ.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовоеДвижение, Объект, "ОрганизацияЕГАИС, ПриборУчета, СуточныеДанные");
		НовоеДвижение.АлкогольнаяПродукция = бг_ЗагрузкаДанныхИзФайловПовтИсп.АлкогольнаяПродукцияПоКоду(ОписаниеПозиции.Product.AlcCode);
		НовоеДвижение.Режим = бг_ЗагрузкаДанныхИзФайловПовтИсп.РежимРаботыПрибораУчетаПоКоду(СокрЛП(ОписаниеПозиции.Mode));
		НовоеДвижение.Температура = ОписаниеПозиции.Temperature;
		НовоеДвижение.Крепость = ОписаниеПозиции.PercentAlc;
		
		Если Объект.СуточныеДанные Тогда
			НовоеДвижение.Период = ОписаниеПозиции.StartDate;
			НовоеДвижение.ОкончаниеПериода = ОписаниеПозиции.EndDate;
			НовоеДвижение.КоличествоДалБСНачало = ОписаниеПозиции.VbsStart;
			НовоеДвижение.КоличествоДалБСОкончание = ОписаниеПозиции.VbsEnd;
			НовоеДвижение.КоличествоДалНачало = ОписаниеПозиции.AStart;
			НовоеДвижение.КоличествоДалОкончание = ОписаниеПозиции.AEnd;
			НовоеДвижение.КоличествоНачало = ОписаниеПозиции.BottleCountStart;
			НовоеДвижение.КоличествоОкончание = ОписаниеПозиции.BottleCountEnd;
		Иначе 
			НовоеДвижение.Период = ОписаниеПозиции.ControlDate;
			НовоеДвижение.КоличествоДалБСНачало = ОписаниеПозиции.VbsControl;
			НовоеДвижение.КоличествоДалНачало = ОписаниеПозиции.AControl;
			НовоеДвижение.КоличествоНачало = ОписаниеПозиции.BottleCountControl;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция СтруктураШапкиДокументаПоДаннымФайла(ОтветXDTO, ДанныеЗагрузки)
	
	ДанныеОрганизацииЕГАИС = бг_ЗагрузкаДанныхИзФайловПовтИсп.ДанныеОрганизацииЕГАИСПоКоду(СокрЛП(ОтветXDTO.Owner.FSRAR_ID));
	Результат = Новый Структура;
	Результат.Вставить("ОрганизацияЕГАИС", ДанныеОрганизацииЕГАИС.ОрганизацияЕГАИС);
	Результат.Вставить("Организация", ДанныеОрганизацииЕГАИС.Организация);
	ДанныеПрибораУчета = Новый Структура;
	ДанныеПрибораУчета.Вставить("Код", СокрЛП(ДанныеЗагрузки.Sensor.SensorNumber));
	ДанныеПрибораУчета.Вставить("ИдентификаторРазмещения", СокрЛП(ДанныеЗагрузки.Sensor.PlaceId));
	ДанныеПрибораУчета.Вставить("Модель", СокрЛП(ДанныеЗагрузки.Sensor.SensorModel));
	ПриборУчета = бг_ЗагрузкаДанныхИзФайловПовтИсп.ПриборУчетаПоКоду(ДанныеПрибораУчета.Код);
	Если Не ЗначениеЗаполнено(ПриборУчета) Тогда
		ПриборУчета = Справочники.бг_ПриборыАСИиУ.НайтиСоздатьПриборУчета(ДанныеПрибораУчета);
	КонецЕсли;	
	Результат.Вставить("ПриборУчета", ПриборУчета);
	
	КодПроизводителя = "";
	ДанныеПроизводителя = ДанныеЗагрузки.Producer;
	Если ДанныеЗагрузки.Producer.Свойства().Получить("UL") <> Неопределено Тогда
		КодПроизводителя = ДанныеПроизводителя.UL.ClientRegId;
	ИначеЕсли ДанныеЗагрузки.Producer.Свойства().Получить("FL") <> Неопределено Тогда
		КодПроизводителя = ДанныеПроизводителя.FL.ClientRegId;
	ИначеЕсли ДанныеЗагрузки.Producer.Свойства().Получить("FO") <> Неопределено Тогда
		КодПроизводителя = ДанныеПроизводителя.FO.ClientRegId;
	ИначеЕсли ДанныеЗагрузки.Producer.Свойства().Получить("TS") <> Неопределено Тогда
		КодПроизводителя = ДанныеПроизводителя.TS.ClientRegId;
	КонецЕсли;	
	Результат.Вставить("Производитель", 
		бг_ЗагрузкаДанныхИзФайловПовтИсп.ДанныеОрганизацииЕГАИСПоКоду(КодПроизводителя).ОрганизацияЕГАИС);

	Возврат Результат;
	
КонецФункции	

Функция АктуальныйПрисоединенныйФайлСДанными(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПрисоединенныеФайлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.битДанныеПриборовАСИиУПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	               |ГДЕ
	               |	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПрисоединенныеФайлы.ДатаСоздания УБЫВ";
	Запрос.УстановитьПараметр("ВладелецФайла", Документ);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти
